
Archived entries from file c:/Users/jiha/Documents/GitHub/emacs.d_org/emacs.org
    
*** DONE make sure it works on windows with svg or else change to png's
		:LOGBOOK:
		CLOCK: [2012-08-21 ti 11:11]--[2012-08-21 ti 11:13] =>  0:02
		- I does not work with svg, need png's on windows. emacs on
			windows does not support svg.
		CLOCK: [2012-08-20 må 10:35]--[2012-08-20 må 11:46] =>  1:11
		:END:
* DONE Make sure not installed packages does not crash startup
	:LOGBOOK:
	- State "DONE"       from "TODO"       [2013-04-25 to 23:07]
	CLOCK: [2013-04-25 to 17:59]--[2013-04-25 to 23:07] =>  5:08
	:PROPERTIES:
	:ARCHIVE_TIME: 2013-04-25 to 23:25
	:ARCHIVE_FILE: c:/Users/jiha/Documents/GitHub/emacs.d_org/emacs.org
	:ARCHIVE_OLPATH: Bugs
	:ARCHIVE_CATEGORY: emacs
	:ARCHIVE_TODO: DONE
	:END:
	- implemented a jiha-safe-require that will log if something is missing, but will not
		error out.
	:END:
	all usage of packages from melpa, marmelade... in this configuration need to be
	enclosed in constructs that will not crash startup when they do not exists. 


* TODO advice tabify/untabify to use the whole buffer if no region is marked.
	 :LOGBOOK:
	 CLOCK: [2014-02-04 ti 12:15]--[2014-02-04 ti 15:22] =>  3:07
	 :END:
	:PROPERTIES:
	:ARCHIVE_TIME: 2014-02-04 ti 12:54
	:ARCHIVE_FILE: c:/Users/jiha/Documents/GitHub/emacs.d_org/emacs.org
	:ARCHIVE_OLPATH: Bugs
	:ARCHIVE_CATEGORY: emacs
	:ARCHIVE_TODO: TODO
	:END:
	 #+BEGIN_SRC elisp
		 (defadvice tabify (around mark-whole-buffer-if-no-region activate)
			 "When using tabify without marking a region, the normal thing in emacs is to do tabify
		 on everthing below point, this feel unatural, this changes that to instead do it on the
		 whole buffer."
			 (save-excursion
				 (if (not (region-active-p)) 
						 (progn
							 (mark-whole-buffer)
							 (ad-do-it)))))
			 
	 #+END_SRC

	 #+RESULTS:
	 : tabify

	 #+BEGIN_SRC elisp
	 (ad-disable-advice 'tabify 'before 'mark-whole-buffer-if-no-region)
	 #+END_SRC

 #+RESULTS:


* FIXED [[*Iswitch%20Buffers][Iswitch Buffers]] has problem on windows with defining my own columns
	:LOGBOOK:
	CLOCK: [2013-09-23 må 16:26]--[2013-09-23 må 16:40] =>  0:14
	- by defining ibuffer-inline-columns before it is used, I get around the
		problem. Maybe i should require something instead.
	CLOCK: [2013-07-02 ti 23:25]--[2013-07-02 ti 23:27] =>  0:02
	:END:
	:PROPERTIES:
	:ARCHIVE_TIME: 2014-06-09 må 15:01
	:ARCHIVE_FILE: c:/Users/jiha/Documents/GitHub/emacs.d_org/emacs.org
	:ARCHIVE_OLPATH: Bugs
	:ARCHIVE_CATEGORY: emacs
	:ARCHIVE_TODO: FIXED
	:END:
	have comment out the src section

	It seems to work now, will leave the bug for now. might resurface and in that case i
	will write more about it.

	tried starting emacs again, it did not work, commented out the region again.

* FIXED we maybe should remove flyspell-prog-mode from languages hooks
	:LOGBOOK:
	CLOCK: [2013-06-13 to 13:44]--[2013-06-13 to 15:01] =>  1:17
	- State "FIXED"      from "TODO"       [2013-06-13 to 15:01] \\
		Fixed now, but need to add modes that tells what to use.
	:PROPERTIES:
	:ARCHIVE_TIME: 2014-06-09 må 15:01
	:ARCHIVE_FILE: c:/Users/jiha/Documents/GitHub/emacs.d_org/emacs.org
	:ARCHIVE_OLPATH: Bugs
	:ARCHIVE_CATEGORY: emacs
	:ARCHIVE_TODO: FIXED
	:END:
	- Refiled on [2013-06-12 on 01:17] \\
		should not have issues spread out in the file
	:END:
	and instead implement a jiha-flyspell-mode that will activate flyspell-prog-mode if
	the major mode is a programming mode and "vanilla" flyspell-mode when it is
	not. and bind that to *C-<F8>*.

